Result from a local test run:

```
% terraform apply  
╷
│ Warning: Provider development overrides are in effect
│ 
│ The following provider development overrides are set in the CLI configuration:
│  - deploymenttheory/jamfpro in /Users/Shared/GitHub/terraform-provider-jamfpro
│ 
│ The behavior may therefore not match any released version of the provider and applying changes may cause the state to become incompatible with
│ published releases.
╵

Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # jamfpro_mobile_device_prestage_enrollment.example_prestage will be created
  + resource "jamfpro_mobile_device_prestage_enrollment" "example_prestage" {
      + allow_pairing                                = false
      + anchor_certificates                          = []
      + auto_advance_setup                           = false
      + configure_device_before_setup_assistant      = true
      + default_prestage                             = false
      + department                                   = "IT Department"
      + device_enrollment_program_instance_id        = "1"
      + display_name                                 = "iOS Device Prestage"
      + enable_device_based_activation_lock          = false
      + enrollment_customization_id                  = "0"
      + enrollment_site_id                           = "-1"
      + id                                           = (known after apply)
      + keep_existing_location_information           = false
      + keep_existing_site_membership                = false
      + mandatory                                    = true
      + maximum_shared_accounts                      = 10
      + mdm_removable                                = false
      + minimum_os_specific_version_ios              = "18.4.1"
      + multi_user                                   = false
      + prestage_minimum_os_target_version_type_ios  = "MINIMUM_OS_SPECIFIC_VERSION"
      + prestage_minimum_os_target_version_type_ipad = "NO_ENFORCEMENT"
      + prevent_activation_lock                      = true
      + profile_uuid                                 = (known after apply)
      + require_authentication                       = false
      + rts_config_profile_id                        = "30"
      + rts_enabled                                  = true
      + site_id                                      = "-1"
      + storage_quota_size_megabytes                 = 1024
      + supervised                                   = true
      + support_email_address                        = "support@mycompany.org"
      + support_phone_number                         = "+44-1234-567890"
      + timezone                                     = "UTC"
      + version_lock                                 = (known after apply)
        # (3 unchanged attributes hidden)

      + location_information {
          + building_id   = "-1"
          + department_id = "1"
          + id            = (known after apply)
          + version_lock  = (known after apply)
            # (6 unchanged attributes hidden)
        }

      + names {
          + assign_names_using       = "Serial Numbers"
          + device_name_prefix       = "ABC-"
          + device_naming_configured = true
          + manage_names             = true
            # (1 unchanged attribute hidden)
        }

      + purchasing_information {
          + id                 = (known after apply)
          + lease_date         = "1970-01-01"
          + leased             = false
          + life_expectancy    = 0
          + po_date            = "1970-01-01"
          + purchased          = true
          + version_lock       = (known after apply)
          + warranty_date      = "1970-01-01"
            # (6 unchanged attributes hidden)
        }

      + skip_setup_items {
          + action_button           = true
          + android                 = true
          + appearance              = true
          + apple_id                = true
          + biometric               = false
          + camera_button           = true
          + cloud_storage           = true
          + diagnostics             = false
          + display_tone            = true
          + enable_lockdown_mode    = true
          + express_language        = true
          + home_button_sensitivity = true
          + imessage_and_facetime   = true
          + intelligence            = true
          + location                = false
          + onboarding              = true
          + passcode                = false
          + payment                 = true
          + preferred_language      = true
          + privacy                 = true
          + restore                 = true
          + restore_completed       = true
          + safety                  = true
          + safety_and_handling     = true
          + screen_saver            = true
          + screen_time             = true
          + sim_setup               = true
          + siri                    = true
          + software_update         = false
          + tap_to_setup            = true
          + terms_of_address        = true
          + tos                     = false
          + transfer_data           = true
          + tv_home_screen_sync     = true
          + tv_provider_sign_in     = true
          + tv_room                 = true
          + update_completed        = false
          + voice_selection         = true
          + watch_migration         = true
          + welcome                 = true
          + zoom                    = true
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

jamfpro_mobile_device_prestage_enrollment.example_prestage: Creating...
jamfpro_mobile_device_prestage_enrollment.example_prestage: Creation complete after 1s [id=18]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Added RTS profile ID and set to enabled:

![image](https://github.com/user-attachments/assets/24bcdfb6-a642-4b88-a473-2e510378c038)
